In [2]:
import pandas as pd

df = pd.read_csv("../Dataset/NIFTY50.csv")
df.head()

       Date     Open     High      Low   Close
0  1/3/2000  1482.15  1592.90  1482.15  1592.2
1  1/4/2000  1594.40  1641.95  1594.40  1638.7
2  1/5/2000  1634.55  1635.50  1555.05  1595.8
3  1/6/2000  1595.80  1639.00  1595.80  1617.6
4  1/7/2000  1616.60  1628.25  1597.20  1613.3

In [3]:
df['Date'] = pd.to_datetime(df['Date'])
df.dtypes

Date     datetime64[ns]
Open            float64
High            float64
Low             float64
Close           float64
dtype: object

In [4]:
df.to_csv("../Dataset/NIFTY50_CLEANED.csv", index=False)

In [5]:
df2 = pd.read_csv("../Dataset/NIFTY50_CLEANED.csv")
df2.head()

         Date     Open     High      Low   Close
0  2000-01-03  1482.15  1592.90  1482.15  1592.2
1  2000-01-04  1594.40  1641.95  1594.40  1638.7
2  2000-01-05  1634.55  1635.50  1555.05  1595.8
3  2000-01-06  1595.80  1639.00  1595.80  1617.6
4  2000-01-07  1616.60  1628.25  1597.20  1613.3